Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/nvm.h
#define NVM_NVMLBWPINV_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMLBWPINV) Register Mask  */


/* NVM register offsets definitions */
#define NVM_NVMCON_REG_OFST            _UINT32_(0x00)      /* (NVM_NVMCON)  Offset */
#define NVM_NVMCONCLR_REG_OFST         _UINT32_(0x04)      /* (NVM_NVMCONCLR)  Offset */
#define NVM_NVMCONSET_REG_OFST         _UINT32_(0x08)      /* (NVM_NVMCONSET)  Offset */
#define NVM_NVMCONINV_REG_OFST         _UINT32_(0x0C)      /* (NVM_NVMCONINV)  Offset */
#define NVM_NVMCON2_REG_OFST           _UINT32_(0x10)      /* (NVM_NVMCON2)  Offset */
#define NVM_NVMCON2CLR_REG_OFST        _UINT32_(0x14)      /* (NVM_NVMCON2CLR)  Offset */
#define NVM_NVMCON2SET_REG_OFST        _UINT32_(0x18)      /* (NVM_NVMCON2SET)  Offset */
#define NVM_NVMCON2INV_REG_OFST        _UINT32_(0x1C)      /* (NVM_NVMCON2INV)  Offset */
#define NVM_NVMKEY_REG_OFST            _UINT32_(0x20)      /* (NVM_NVMKEY)  Offset */
#define NVM_NVMADDR_REG_OFST           _UINT32_(0x30)      /* (NVM_NVMADDR)  Offset */
#define NVM_NVMDATA0_REG_OFST          _UINT32_(0x40)      /* (NVM_NVMDATA0)  Offset */
#define NVM_NVMDATA1_REG_OFST          _UINT32_(0x50)      /* (NVM_NVMDATA1)  Offset */
#define NVM_NVMDATA2_REG_OFST          _UINT32_(0x60)      /* (NVM_NVMDATA2)  Offset */
#define NVM_NVMDATA3_REG_OFST          _UINT32_(0x70)      /* (NVM_NVMDATA3)  Offset */
#define NVM_NVMDATA4_REG_OFST          _UINT32_(0x80)      /* (NVM_NVMDATA4)  Offset */
#define NVM_NVMDATA5_REG_OFST          _UINT32_(0x90)      /* (NVM_NVMDATA5)  Offset */
#define NVM_NVMDATA6_REG_OFST          _UINT32_(0xA0)      /* (NVM_NVMDATA6)  Offset */
#define NVM_NVMDATA7_REG_OFST          _UINT32_(0xB0)      /* (NVM_NVMDATA7)  Offset */
#define NVM_NVMSRCADDR_REG_OFST        _UINT32_(0xC0)      /* (NVM_NVMSRCADDR)  Offset */
#define NVM_NVMPWPLT_REG_OFST          _UINT32_(0xD0)      /* (NVM_NVMPWPLT)  Offset */
#define NVM_NVMPWPLTCLR_REG_OFST       _UINT32_(0xD4)      /* (NVM_NVMPWPLTCLR)  Offset */
#define NVM_NVMPWPLTSET_REG_OFST       _UINT32_(0xD8)      /* (NVM_NVMPWPLTSET)  Offset */
#define NVM_NVMPWPLTINV_REG_OFST       _UINT32_(0xDC)      /* (NVM_NVMPWPLTINV)  Offset */
#define NVM_NVMPWPGTE_REG_OFST         _UINT32_(0xE0)      /* (NVM_NVMPWPGTE)  Offset */
#define NVM_NVMPWPGTECLR_REG_OFST      _UINT32_(0xE4)      /* (NVM_NVMPWPGTECLR)  Offset */
#define NVM_NVMPWPGTESET_REG_OFST      _UINT32_(0xE8)      /* (NVM_NVMPWPGTESET)  Offset */
#define NVM_NVMPWPGTEINV_REG_OFST      _UINT32_(0xEC)      /* (NVM_NVMPWPGTEINV)  Offset */
#define NVM_NVMLBWP_REG_OFST           _UINT32_(0xF0)      /* (NVM_NVMLBWP)  Offset */
#define NVM_NVMLBWPCLR_REG_OFST        _UINT32_(0xF4)      /* (NVM_NVMLBWPCLR)  Offset */
#define NVM_NVMLBWPSET_REG_OFST        _UINT32_(0xF8)      /* (NVM_NVMLBWPSET)  Offset */
#define NVM_NVMLBWPINV_REG_OFST        _UINT32_(0xFC)      /* (NVM_NVMLBWPINV)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* NVM register API structure */
typedef struct
{  /* flash controller */
  __IO  uint32_t                       NVM_NVMCON;         /* Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCONCLR;      /* Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCONSET;      /* Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCONINV;      /* Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCON2;        /* Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCON2CLR;     /* Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCON2SET;     /* Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMCON2INV;     /* Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       NVM_NVMKEY;         /* Offset: 0x20 (R/W  32)  */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       NVM_NVMADDR;        /* Offset: 0x30 (R/W  32)  */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       NVM_NVMDATA0;       /* Offset: 0x40 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       NVM_NVMDATA1;       /* Offset: 0x50 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       NVM_NVMDATA2;       /* Offset: 0x60 (R/W  32)  */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       NVM_NVMDATA3;       /* Offset: 0x70 (R/W  32)  */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       NVM_NVMDATA4;       /* Offset: 0x80 (R/W  32)  */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       NVM_NVMDATA5;       /* Offset: 0x90 (R/W  32)  */
  __I   uint8_t                        Reserved8[0x0C];
  __IO  uint32_t                       NVM_NVMDATA6;       /* Offset: 0xA0 (R/W  32)  */
  __I   uint8_t                        Reserved9[0x0C];
  __IO  uint32_t                       NVM_NVMDATA7;       /* Offset: 0xB0 (R/W  32)  */
  __I   uint8_t                        Reserved10[0x0C];
  __IO  uint32_t                       NVM_NVMSRCADDR;     /* Offset: 0xC0 (R/W  32)  */
  __I   uint8_t                        Reserved11[0x0C];
  __IO  uint32_t                       NVM_NVMPWPLT;       /* Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPLTCLR;    /* Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPLTSET;    /* Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPLTINV;    /* Offset: 0xDC (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPGTE;      /* Offset: 0xE0 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPGTECLR;   /* Offset: 0xE4 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPGTESET;   /* Offset: 0xE8 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMPWPGTEINV;   /* Offset: 0xEC (R/W  32)  */
  __IO  uint32_t                       NVM_NVMLBWP;        /* Offset: 0xF0 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMLBWPCLR;     /* Offset: 0xF4 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMLBWPSET;     /* Offset: 0xF8 (R/W  32)  */
  __IO  uint32_t                       NVM_NVMLBWPINV;     /* Offset: 0xFC (R/W  32)  */
} nvm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_NVM_COMPONENT_H_ */
